[
  {
    "name": "Harry O'Brien",
    "rating": 5,
    "text": "Seems to be hard to find an honest, trustworthy contractor these days. We had hail damage on three roofs so I hired a contractor that gave me the run around so I canceled my agreement with them and was referred to Gates Enterprise and I am glad I was. Matt came out to meet with me to provide a quote. First impressions are important and Matt was early, professional and knowledgeable. No high pressure sales and I chose him after meeting with two others. Matt scheduled the team who showed up early and worked hard and completed the job early and went above and beyond all commitments. If you need a honest professional and cost effective roofer I would highly suggest you give Gates Enterprise a try. You won't regret it. Great job Matt and Thank you!!!",
    "source": "google",
    "date": "Dec 2024"
  },
  {
    "name": "Rozanet Herrera",
    "rating": 5,
    "text": "All around a great experience with Gates Enterprises, especially Zack who was our main guy. They were efficient and kept the property clean. Very pleased!",
    "source": "google",
    "date": ""
  },
  {
    "name": "Jamie Ryman",
    "rating": 5,
    "text": "I recently hired Gates Enterprises for some work on my home in Colorado, and I couldn't be happier with the experience! From the initial consultation to the final touches, the team was professional, friendly, and incredibly knowledgeable. I worked directly with Giovanny and he took the time to explain the materials and options available, ensuring I felt confident in my choices. The crew worked efficiently and paid great attention to detail, which was evident in the quality of the finished roof. They kept the site clean and respected my property throughout the entire process. Communication was excellent on behalf of Giovanny; I received regular updates on the progress and any concerns that arose. The pricing was transparent with no hidden fees, which I greatly appreciated. Thank you Giovanny for your assistance during this process!",
    "source": "google",
    "date": "Dec 2024"
  },
  {
    "name": "Michelle Ortiz",
    "rating": 5,
    "text": "Our previous contractor ended up giving us the run around and I felt pressured and rushed into making decisions. Once we started working with Matt, it was night and day and Matt restored my trust and faith that things would get completed and he had such an ease about himself. He was always communicating, even if it was something as simple as 'we are still waiting on product'. If he didn't know an answer to something he would actually find out and get back to me! He was always available when needed and was a pleasure to work with. Thanks Matt for all you did for us!",
    "source": "google",
    "date": "Jan 2025"
  },
  {
    "name": "Jack Rickard",
    "rating": 5,
    "text": "Five stars aren't enough! Max Acuna and his team went above and beyond my expectations. Max personally negotiated with my insurance company, securing a comprehensive hail damage settlement that I never anticipated. The entire job was evaluated and completed weeks ahead of schedule. To top it off, the new high quality roof shingles are now saving us a significant amount on our yearly insurance costs. I can't praise Max's professionalism, transparent approach, and reasonable pricing enough. Highly recommended!",
    "source": "google",
    "date": "Jan 2025"
  },
  {
    "name": "Yanely Gutierrez",
    "rating": 5,
    "text": "I had the pleasure to work with Giovanny. I must say it was a pleasant and amazing experience working with him; he was very professional, on time and communicated through the whole process! Definitely happy with the work and the services done by Gates Enterprises",
    "source": "google",
    "date": ""
  }
]
